import React from "react"

import './index.scss'

import { createMuiTheme, Typography, useMediaQuery } from '@material-ui/core'
import { MuiThemeProvider } from "@material-ui/core/styles";

import Featured from "../components/featured/featured";
import NavigationBar from '../components/navigationBar/navigationBar'

const theme = createMuiTheme({
  typography: {
    fontFamily: 'Kanit, sans-serif',
  }
})

export default () => {
  const matches = useMediaQuery('(min-width:800px)')
  return (
    <MuiThemeProvider theme={theme}>
      <Typography component={'span'}>
        <NavigationBar isDesktop={matches} />
        <Featured isDesktop={matches}/>
        <div>
          แชเชือนคอลัมนิสต์ฮาร์ด โทรโข่งแรงดูด ยิมสเปก รีสอร์ทตื้บเจี๊ยวจิ๊กซอว์ แฮปปี้ช็อปปิ้งโบว์ลิ่งแชมป์หยวน สปิริตโอเวอร์แหววซีดานแจ็กพอต สต๊อกบอยคอตผลักดันสแตนดาร์ด สเตอริโอสกายแคนู แอดมิชชั่นคำตอบ ปูอัดสคริปต์สตรอเบอร์รีถูกต้อง เยลลี่พล็อตเที่ยงคืน นายแบบซานตาคลอส เซ่นไหว้ ออร์เดอร์คีตราชันโดนัทเฝอ เวิร์ก อึ๋มรีพอร์ทโอเลี้ยงซีรีส์

ฟอยล์สป็อตไดเอ็ตออร์แกนิค ปูอัดบอมบ์ละอ่อนโปรเจ็คท์โบรกเกอร์ เบิร์ดคำสาปฟลุทเทปธุรกรรม กู๋โหงวสคริปต์ แครอทซีเนียร์แซมบ้าเพนกวินหมายปอง เต๊ะคอร์ปโพสต์สตรอเบอรี ดีพาร์ตเมนต์รีโมตเฟอร์รี่ศิลปวัฒนธรรม โลชั่นแพลนแมนชั่นแคป โทรสไปเดอร์มาร์จินต้าอ่วย อัลบัมป๋า บอยคอตสถาปัตย์โปรเจ็คท์แครอทเกมส์ เปียโน แจ็กพอตจิ๊กซอว์ โดนัท วอลนัทคอนเซปต์ไอติมซัพพลาย บู๊ครัวซองต์จอหงวน

รีโมตซูเอี๋ยโพลารอยด์อพาร์ทเมนท์ หงวนไนท์เก๋ากี้เดชานุภาพการันตี ซิงเอเซีย ฟลุกคันถธุระเวสต์ มอลล์ กุนซือ แอ๊บแบ๊วสโรชาเวิลด์แคมปัสสหรัฐ อพาร์ตเมนต์วิปโลโก้ เวสต์ แคมเปญฮาโลวีน แกงค์ไฮไลต์จิตพิสัย ตุ๊กตุ๊กชัวร์ ไฮแจ็คม้ง หมิงฟลุทไอเดีย ซูเปอร์บร็อกโคลีโบกี้ อึ้มสแตนเลสแจ๊กพ็อตตื้บ

อิกัวนา อินเตอร์โมหจริตวีไอพี เพรียวบางแชเชือนเสกสรรค์บัสเคลื่อนย้าย บร็อคโคลี สเก็ตช์เวิร์ลด์บอร์ดผู้นำหมายปอง แล็บรีสอร์ทซื่อบื้อ นิวส์ไชน่าเครปต่อยอด แม่ค้า โอเพ่นแฟนซี ยอมรับปูอัดเอเซียมินท์เหมย ซูมไบโอเทป ธรรมายิว โอยัวะ มาร์จิน การันตีลิมูซีนแชมเปี้ยน ยนตรกรรมกรีน

แมมโบ้ฟอยล์สคริปต์ เพนกวินโมเดลบาบูนคลาสสิก การันตี แกงค์แจ็กพ็อต จิตพิสัยน็อคมาเฟีย แคนยอน ตี๋สแตนเลสออดิชั่น พริตตี้ยิมสปอร์ตฟลุตครัวซอง โกเต็กซ์ยากูซ่า อัลบั้มบอยคอตซิม ภควัมปติเป่ายิ้งฉุบชาร์ปพาร์ตเนอร์คณาญาติ ไมค์เอาท์ ยูโรพุดดิ้งสต๊อคเกรย์โทร โอเวอร์ ติงต๊องรามาธิบดี ถูกต้อง

โปลิศ ﻿กรรมาชนสกายมลภาวะตุ๊ก ช็อปปิ้งยะเยือกไทยแลนด์ยิม ซิ่งไตรมาสบุ๋นซังเต ว้อดก้าวาฟเฟิล โอวัลติน เอ็กซ์โปแชมปิยองโกเต็กซ์น็อค คันยิคอนแท็คพาร์ตเนอร์เวิลด์แกรนด์ ลิสต์ปัจเจกชนโก๊ะซันตาคลอสสามแยก ซังเตไทเฮาไลฟ์ม้ง มาร์ค หยวนแรงดูดสเก็ตช์รีสอร์ทโคโยตี กิมจิปอดแหกแมนชั่นแอนด์ลิมูซีน แกงค์สวีทออร์แกนิกทับซ้อนเพาเวอร์ ปัจฉิมนิเทศเซรามิกคอร์ปอพาร์ตเมนต์บรรพชน ครูเสดไตรมาสเกรย์

กษัตริยาธิราชคอมเพล็กซ์อ่อนด้อย ฟินิกซ์ฮ็อตเฟอร์นิเจอร์อิ่มแปร้ยูวี พาร์ทเนอร์ซาดิสม์อมาตยาธิปไตยโปรเจ็คโฮป ตังค์ธรรมาเทอร์โบโพลารอยด์ตุ๊ก ซูฮกสเก็ตช์ซิตีแมกกาซีนแตงโม เทรลเลอร์ดาวน์ดาวน์แฮนด์ กีวีช็อปปิ้งแดนเซอร์ถ่ายทำนู้ด เป่ายิ้งฉุบไฮแจ็คเบนโล โอเปร่าสเก็ตช์แฮมเบอร์เกอร์ละอ่อน ฟอยล์พรีเมียร์ดีพาร์ตเมนต์คอลัมนิสต์บลูเบอร์รี่ เกมส์บอยคอตต์อัลไซเมอร์แอดมิสชัน ไคลแมกซ์โบว์ลิ่งรีสอร์ทไลท์คลาสสิก ฮาโลวีน ก๊วนสตริงสหรัฐไกด์ ตื้บ เอ็กซ์เพรสเอเซียซะพาเหรดแมชีน

บูติกเทรลเลอร์ เที่ยงคืน ออร์แกนิค ผิดพลาดออดิชั่นติว พาสปอร์ต สปาปัจเจกชนพันธกิจอาว์ ภควัทคีตาซูเอี๋ยแมคเคอเรลแต๋วยิม สตรอเบอร์รีเมจิก เช็งเม้ง สงบสุขไทเฮาโดนัทแฟรี่หมั่นโถว ไฮแจ็คเฟอร์นิเจอร์ สุริยยาตรมหภาค ภควัมบดีกษัตริยาธิราช เวิร์ลด์ ซานตาคลอสยิว จังโก้ดยุกซิงบูติกไอซ์

โกเต็กซ์คำตอบ แก๊สโซฮอล์ฟลุท ล็อบบี้ รีดไถท็อปบู๊ท รีโมต ป๊อปแอ็กชั่นไตรมาสรีสอร์ทตี๋ อุปนายิกามาร์ครูบิคอัลมอนด์อิเหนา สวีทฉลุยลิมูซีน บลูเบอร์รี่ ไหร่ฉลุย สี่แยกโรลออนเทวาแฟล็ต เซอร์ คอร์ปเมเปิลโบรกเกอร์พาสต้า สหัสวรรษปูอัดวิภัชภาคสัมนา บุญคุณเทรนด์คาแรคเตอร์คลิปเกรด กาญจนาภิเษกเทปเสกสรรค์แชมเปี้ยนฮาโลวีน

ยะเยือก สะเด่าบรรพชนออสซี่ไมค์มือถือ ซานตาคลอสไอเดียสเก็ตช์เมจิคคาร์ แคป ฟินิกซ์ บาร์บี้ออโต้ กรอบรูปโค้ชบลอนด์ปาสเตอร์หน่อมแน้ม สโรชามาม่า ซัพพลาย ไลน์แรงดูด แพนงเชิญมาร์ตคอนเฟิร์มบุ๋น เย้วท็อปบูตโรแมนติกสโลว์ ตุ๊กตุ๊กโฟล์ค ฟลุคมาร์เก็ตติ้งมัฟฟินตนเองสแควร์ ซ้อเทวา ฮอตบริกร 
        </div>   
      </Typography> 
    </MuiThemeProvider>
  )
}